2D_Viscous/Biplane_Wall_Functions/system/forceCoeffs
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

forceCoeffs1
	{
	
		// Mandatory entries
		type            forceCoeffs;
		libs            ("libforces.so");
		
		writeControl    runTime;
		writeInterval   1; //now every second

		patches         (upperairfoil lowerairfoil);
		
		// Optional entries
		//Field names
		rhoInf         1.4;
		// Centre of rotation for moment calculations
		CofR            (0 0 0); //Origin of domain and airfoil

		// Lift direction
		liftDir         (0 1 0);
		// Drag direction
		dragDir         (1 0 0);
		// Pitch axis
		pitchAxis            (0 0 1); //z-axis
		// Freestream velocity magnitude [m/s]	
		magUInf         1.7;
		
		// Reference length [m]
		lRef            1;
		// Reference area [m2]
		Aref            1.00;
	}


// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

